STATUS =\
{
    # 512: "Принтер занят.",
    4194304: "Дверь принтера открыта.",
    2: "Принтер находится в состоянии ошибки.",
    32768: "Идет инициализация принтера.",
    256: "Принтер находится в активном состоянии ввода-вывода.",
    32: "Принтер находится в состоянии канала вручную.",
    262144: "В принтере закончился тонер.",
    4096: "Принтер недоступен для печати.",
    128: "Принтер отключен.",
    2097152: "На принтере не хватает памяти.",
    2048: "Выходной лоток принтера полностью заполнен.",
    524288: "Принтер не может распечатать текущую страницу.",
    8: "Бумага застряла в принтере.",
    16: "Принтер не имеет бумаги.",
    64: "На принтере возникла проблема с бумагой.",
    1: "Принтер приостановлен.",
    4: "Принтер удаляется.",
    # 16777216: "Принтер находится в режиме экономии энергии.",
    # 1024: "Принтер выполняет печать.",
    # 16384: "Принтер обрабатывает задание печати.",
    8388608: "Состояние принтера неизвестно.",
    131072: "Принтер имеет низкий уровень тонера.",
    1048576: "Принтер имеет ошибку, которая требует от пользователя выполнить что-то.",
    8192: "Принтер ожидает.",
    65536: "Идет прогрев принтера."
}

ALLOWED_EXTENSIONS = {'.pdf', '.doc', '.docx'}